<?php
/**
* +----------------------------------------------------------------------
* 创建日期：2017年12月18日16:18:53
* 最新修改时间：2017年12月18日16:18:53
* +----------------------------------------------------------------------
* https：//github.com/ALNY-AC
* +----------------------------------------------------------------------
* 微信：AJS0314
* +----------------------------------------------------------------------
* QQ:1173197065
* +----------------------------------------------------------------------
* #####测试控制器#####
* @author 代码狮
*
*/
namespace Origin\Controller;
use Think\Controller;
class TestController extends CommonController{
    
    public function test(){
        $get=I('get.');
        $post=I('post.');
        
        $res=[];
        $res['res']=1;
        $res['msg']='测试';
        $res['get']=$get;
        $res['post']=$post;
        
        //=========输出json=========
        echo json_encode($res);
        //=========输出json=========
        
        
    }
    
}